/*
TASK 0
Дано число x, верните сумму x+xx+xxx (x раз) строкой.
Для например числа 2: 2+22 = "24"
  => 3: 3+33+333 = "369"
  arguments [3] :expected "369"
  arguments [5] :expected "61725"
  arguments [6] :expected "740736"
  arguments [8] :expected "98765424"
  
  @super
  arguments [9] :expected ""
  arguments [10] :expected ""
*/

/*
Phone-app
TASK 1
edit-contact, add-user при клике
- сделать данные редактируемыми (атрибут contentEditable)
- изменять backgroundColor
index.html - в поле search при вводе буквы, добавить поиск по имени
если имя включает хотя бы одну эту букву!.
после ввода каждого символа, фильтровать отображаемых пользователей.
При удалении всех символов отобразить снова весь список
TASK 2
1. keypad - сделать чтобы номер можно было набрать с клавиатуры
2. Формат номера сделать вот таким (099)-17-38-170
*/


/*
Task 3
Добавить роутинг для всех страниц
*/
/*
Добавить кота в ваш КОД в Node.js !!
*/